SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-72008-D

Comment( British Rail Standard 6MT 4-6-2 Locomotive )
Comment( ******RESISTANCE BASED ON STILL WIND*******)

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_6MT_72008.s )
Size  ( 2.49485m 3.91749m 13.480869m )
Mass ( 88.5t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 0cm 10cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 10cm 20cm )
			)
	CouplingHasRigidConnection (0)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
Comment ( * Locomotive is steam braked * )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 242kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )

ORTSBrakeCylinderSize ( 6in ) Comment ( Locomotive has steam brake  )
ORTSAuxilaryResCapacity ( 0.90ft^3 ) Comment ( Vacuum reservoir used for control of steam brake )


Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.84m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft 0.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990- DWx18)
ORTSDavis_A ( 6244 )
ORTSDavis_B ( 25.59 )
ORTSDavis_C ( 5.395 )

ORTSWagonFrontalArea (101)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 1.0 1.46 6.3 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front White Lamp Position A )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 3.32 5.735 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
		)

Comment( ******* Miscellaneous Wagon Information************ )

FreightAnim ( "..\\common.crew\\LIB_2\\Std7.s" 0 3.0 0.0 )


Comment (Passenger View)	
	Inside (
	   WagonShape ( DR_BR_6MT_72008.s )
        PassengerCabinHeadPos ( 1.423 3.0 -5.34 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ( "..\\..\\Common.MEP\\MEPBlack5Sound\\Black5eng.sms" )
)



Engine ( OR-72008-D

Comment( *Known Parameters Required for OR - Engine Section*)

Comment (Section for Engine Effects - Steam Emissions, Stack) 

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0.813 3.4 3.2
				-1 1 0
				0.11
			)

			SafetyValvesFX
			(
				0.154 3.75 -1.65
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				-0.154 3.75 -1.65
				0 1 0
				0.2
			)
			StackFX
			(
				0 4.32 4.6
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.32 4.6
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.32 4.6
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-1 -1 -1
				0.05
			)

			Injectors2FX
			(
				1.05 0.65 -4.45
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.05 0.65 -4.65
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-1.052 0.801 5.1
				0 0.1 1
				0.19
			)

			CylindersFX
			(
				1.052 0.801 5.1
				0 0.1 1
				0.19      
			)
		)
	)


Wagon ( OR-72008-D )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 37in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 56.9t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 274ft^3 ) 
ORTSEvaporationArea ( 2073ft^2 )Comment(2073)
ORTSSuperheatArea ( 592ft^2 )Comment(592)
MaxBoilerPressure ( 225psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 28in ) 
CylinderDiameter ( 19.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 36ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 7t-uk )
MaxTenderWaterMass ( 42500lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15 ) 

ORTSMaxIndicatedHorsepower ( 1700hp )

ORTSMaxSuperheatTemperature ( 290.0 )

ORTSSuperheatCutoffPressureFactor ( 55.0 )

Comment(ORTSCylinderPortOpening ( 0.085 ))comment(0.05 to 0.12 Saturation Only)

ORTSBoilerEfficiency( 0.0 0.96  180.0 0.48 )comment(Report 8P Gr 16)comment(0 0.97 140.0 0.485)

Comment(ORTSBurnRate( 0.0 10.0   9714.0 1000.0   17714.0 2000.0   23714.0 3000.0   28571.0 4000.0   31428.0 5000.0   33428.0 6000.0  )) Comment(BR6&7 Burn Rate)

ORTSBurnRate( 0.0 10.0   11500.0 1000.0   20000.0 2000.0   26000.0 3000.0   34500.0 4000.0   36000.0 5000.0   36500.0 6000.0  )Comment (BR7 mofified down slightly)

ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 )

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

    
Comment ( *******************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
BrakesEngineBrakeType ( "Steam_brake" )Comment(steam_brake crahes OR in Brake HUD)
TrainPipeLeakRate ( 0.05inHg/s )


Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( == Independent Brake valve - Engine & Tender == )
EngineBrakesControllerMaxReleaseRate ( 2.0inHg/s )
EngineBrakesControllerMaxApplicationRate ( 2.0inHg/s )


Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Locomotive brake based upon Gresham & Craven MkIV Steam Brake Valve )
Brake_Engine ( 0 1 0.25 0.0
NumNotches( 5
Notch( 0.00 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.25 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.50 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.75 0 EngineBrakesControllerBrakeNotchStart )
Notch( 1.00 0 EngineBrakesControllerBrakeNotchStart ) ) )


Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

Brake_Brakeman ( 0 1 0.2 0.3
NumNotches ( 1
Notch( 0 1 BrakemanBrakesControllerManualBrakingStart ) ) )
FireDoor ( 4 4 0.4 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
SmallEjectorOrCompressor( 0 1 1 )
BellToggle( 0 1 0 )
Headlights( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( Clan.cvf )
HeadOut (  -1.423 3.0 -5.34 )
Sound ( "..\\..\\Common.MEP\\MEPBlack5Sound\\Black5cab.sms" )
Name ( "72008 Clan MacLoud, ClassD XPFreight, BR1 Tender, Coal 7t, Water 4250gal" )
Description (
"The Standard class 6, otherwise known as the Clan Class, was a class of 4-6-2 Pacific tender steam locomotive designed by Robert Riddles for use by British Railways. Ten locomotives were constructed between 1951 and 1952, with a further 15 planned for construction. However, due to acute steel shortages in Britain, the order was continually postponed until it was finally cancelled on the publication of the 1955 Modernisation Plan for the re-equipment of British Railways. All of the original locomotives were scrapped, but a replica is being built.

The Clan Class was based upon the Britannia Class design, incorporating a smaller boiler and various weight-saving measures to increase the route availability of a Pacific-type locomotive for its intended area of operations, the west of Scotland. The Clan Class received a mixed reception from crews, with those regularly operating the locomotives giving favourable reports as regards performance.[2] However, trials in other areas of the British Railways network returned negative feedback, a common complaint being that difficulty in steaming the locomotive made it hard to adhere to timetables. Reports exist that suggest a degree of the disappointment with these locomotives was attributable to their being allocated to Class 7 work where they were only a Class 6 in reality; a problem put down to their very similar appearance to the BR Standard Class 7.

The Clan Class had a mixed reception when first introduced to British Railways locomotive crews because there were only 10 locomotives in a class that was mostly confined to the North West of the railway network. This was due to the fact the low number of class members prevented effective training of locomotive crews throughout the nationalised network, and a degree of partisanship amongst crews towards newer locomotives further ensured this.[15] The entire class was also based predominantly at two depots throughout their working lives, these being Glasgow Polmadie and Carlisle Kingmoor, compounding their restricted circulation. However, factors such as these meant that they spent most of their short careers out of the limelight that the Britannias had, resulting in a relatively camera shy class of locomotive. Crews that used them on regular duties displayed their liking for the locomotives, and as such, could produce good work.[2] However, the predominant number of crews who were unfamiliar with the Clans found them difficult to handle, leading to an undeservedly bad reputation.")
)

